tap "candid82/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "mopidy/mopidy"
tap "railwaycat/emacsmacport"
tap "rigellute/tap"
tap "romkatv/powerlevel10k"
tap "yqrashawn/goku"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Text-based personal organizer
brew "calcurse"
# Emacs dependency management
brew "cask"
# Tiling window manager for macOS based on plugin architecture
brew "chunkwm"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# GitHub Markdown previewer
brew "grip"
# Perceptual JPEG encoder
brew "guetzli"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Cross platform, open source .NET development framework
brew "mono"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ncurses-based client for the Music Player Daemon
brew "ncmpcpp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Command-line tool to customize Spotify client
brew "khanhas/tap/spicetify-cli"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# A terminal user interface for Spotify
brew "rigellute/tap/spotify-tui"
# karabiner configurator
brew "yqrashawn/goku/goku"
cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "calibre"
cask "coderunner"
cask "copyq"
cask "emacs-mac"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "ichm"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "kap"
cask "key-codes"
cask "keyboard-maestro"
cask "libreoffice"
cask "mongodb-compass-community"
cask "pastebot"
cask "paw"
cask "postman"
cask "sonos"
cask "tunnelblick"
cask "ubersicht"
cask "visual-studio-code"
