tap "buildkite/buildkite"
tap "buildkite/cli"
tap "candid82/brew"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "mopidy/mopidy"
tap "rigellute/tap"
tap "yqrashawn/goku"
# Official Amazon AWS command-line interface
brew "awscli", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Manage compile and link flags for libraries
brew "pkg-config"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# GitHub Markdown previewer
brew "grip"
# Improved top (interactive process viewer)
brew "htop"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Website copier/offline browser
brew "httrack"
# LLVM's OpenMP runtime library
brew "libomp"
# Simple terminal UI for git commands
brew "lazygit"
# Cross platform, open source .NET development framework
brew "mono"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ncurses-based client for the Music Player Daemon
brew "ncmpcpp"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Manage multiple Node.js versions
brew "nvm"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line interface for Spotify on a Mac
brew "shpotify"
# Tool to build, change, and version infrastructure
brew "terraform"
# Open source continuous file synchronization application
brew "syncthing"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# A command line interface for Buildkite.
brew "buildkite/cli/bk"
# Command-line tool to customize Spotify client
brew "khanhas/tap/spicetify-cli"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.0"
# A terminal user interface for Spotify
brew "rigellute/tap/spotify-tui"
# karabiner configurator
brew "yqrashawn/goku/goku"
cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "clion"
cask "firefox"
cask "coderunner"
cask "font-fira-code"
cask "google-chrome"
cask "gpg-suite"
cask "ichm"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "kap"
cask "key-codes"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "libreoffice"
cask "mongodb-compass-community"
cask "paw"
cask "keycastr"
cask "monitorcontrol"
cask "mounty"
cask "openmtp"
cask "plover"
cask "postman"
cask "sonos"
cask "private-internet-access"
cask "qbittorrent"
cask "spotify"
cask "tunnelblick"
cask "ubersicht"
cask "visual-studio-code"
cask "zsa-wally"
